[NoCoverage] PublicVisibility
User/Communication/Controller/LoginController.php:12:5
 
 class LoginController extends AbstractController
 {
-    #[Route('/login', name: 'app_login')]
+    protected function index(AuthenticationUtils $authenticationUtils) : Response
     public function index(AuthenticationUtils $authenticationUtils): Response
     {

[NoCoverage] ArrayItemRemoval
User/Communication/Controller/LoginController.php:21:9
         // last username entered by the user
         $lastUsername = $authenticationUtils->getLastUsername();
 
-        return $this->render('login/index.html.twig', [
-            'controller_name' => 'LoginController',
-            'last_username' => $lastUsername,
-            'error' => $error,
-        ]);
+        return $this->render('login/index.html.twig', ['last_username' => $lastUsername, 'error' => $error]);
     }
 

[NoCoverage] PublicVisibility
User/Communication/Controller/LoginController.php:28:5
         ]);
     }
 
-    #[Route('/logout', name: 'app_logout')]
+    protected function logout(AuthenticationUtils $authenticationUtils) : void
     public function logout(AuthenticationUtils $authenticationUtils): void
     {
