[NoCoverage] PublicVisibility
Account/Communication/Controller/DepositController.php:18:5
     {
     }
 
-    #[Route('/deposit/amount', name: 'deposit_amount', methods: ['POST'])]
+    protected function amount(Request $request) : RedirectResponse
     public function amount(Request $request): RedirectResponse
     {

[NoCoverage] MethodCallRemoval
Account/Communication/Controller/DepositController.php:25:9
 
         $validateThis = $this->accountBusinessFacade->transformInput($input);
 
-        $this->accountBusinessFacade->validate($validateThis, $this->getLoggedInUser()->getId());
+        
         $amount = $validateThis;
 

[NoCoverage] MethodCallRemoval
Account/Communication/Controller/DepositController.php:29:9
         $amount = $validateThis;
 
         $save = $this->accountBusinessFacade->prepareDeposit($amount, $this->getLoggedInUser()->getId());
-        $this->accountBusinessFacade->saveDeposit($save);
+        
 
         return new RedirectResponse('/deposit?success=amount');

[Killed] Identical
Account/Communication/Controller/DepositController.php:41:9
         $error = null;
 
         $success = $request->get('success');
-        if ($success === 'amount') {
+        if ($success !== 'amount') {
             $success = "Die Transaction wurde erfolgreich gespeichert!";
         }
killedBy: App\Tests\src\Component\Account\Communication\DepositControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\DepositControllerTest::testAction
TypeError: Symfony\Bundle\FrameworkBundle\KernelBrowser::loginUser(): Argument #1 ($user) must be of type object, null given, called in /home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Communication/DepositControllerTest.php on line 17

/home/simondewendt/PhpstormProjects/CashAppSymfony

[Killed] NotIdentical
Account/Communication/Controller/DepositController.php:51:9
 
         $input = $_POST["amount"] ?? null;
 
-        if ($input !== null) {
+        if ($input === null) {
             $validateThis = $this->accountBusinessFacade->transformInput($input);
 
killedBy: App\Tests\src\Component\Account\Communication\DepositControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\DepositControllerTest::testAction
TypeError: Symfony\Bundle\FrameworkBundle\KernelBrowser::loginUser(): Argument #1 ($user) must be of type object, null given, called in /home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Communication/DepositControllerTest.php on line 17

/home/simondewendt/PhpstormProjects/CashAppSymfony
