[NoCoverage] PublicVisibility
Account/Communication/Controller/NewDepositController.php:19:5
     {
     }
 
-    #[Route ('/depositNew', name: 'depositnew')]
+    protected function action(Request $request) : Response
     public function action(Request $request): Response
     {

[NoCoverage] MethodCallRemoval
Account/Communication/Controller/NewDepositController.php:33:9
 
         $transaction = new TransactionDTO();
         $form = $this->createForm(TransactionDTOType::class, $transaction);
-        $form->handleRequest($request);
+        
 
         if ($form->isSubmitted() && $form->isValid()) {

[NoCoverage] LogicalAndAllSubExprNegation
Account/Communication/Controller/NewDepositController.php:35:9
         $form = $this->createForm(TransactionDTOType::class, $transaction);
         $form->handleRequest($request);
 
-        if ($form->isSubmitted() && $form->isValid()) {
+        if (!$form->isSubmitted() && !$form->isValid()) {
             $value = $transaction->getValue();
             $activeUserID = $this->getLoggedInUser()->getId();

[NoCoverage] MethodCallRemoval
Account/Communication/Controller/NewDepositController.php:40:13
             $activeUserID = $this->getLoggedInUser()->getId();
 
             $saveData = $this->accountBusinessFacade->prepareDeposit($value, $activeUserID);
-            $this->accountBusinessFacade->saveDeposit($saveData);
+            
 
             $success = 'Die Transaktion wurde erfolgreich gespeichert!';
