31) /home/simondewendt/PhpstormProjects/CashAppSymfony/src/Component/User/Communication/Controller/LoginController.php:12    [M] PublicVisibility

--- Original
+++ New
@@ @@
 class LoginController extends AbstractController
 {
     #[Route('/login', name: 'app_login')]
-    public function index(AuthenticationUtils $authenticationUtils) : Response
+    protected function index(AuthenticationUtils $authenticationUtils) : Response
     {
         // get the login error if there is one
         $error = $authenticationUtils->getLastAuthenticationError();

32) /home/simondewendt/PhpstormProjects/CashAppSymfony/src/Component/User/Communication/Controller/LoginController.php:21    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $error = $authenticationUtils->getLastAuthenticationError();
         // last username entered by the user
         $lastUsername = $authenticationUtils->getLastUsername();
-        return $this->render('login/index.html.twig', ['controller_name' => 'LoginController', 'last_username' => $lastUsername, 'error' => $error]);
+        return $this->render('login/index.html.twig', ['last_username' => $lastUsername, 'error' => $error]);
     }
     #[Route('/logout', name: 'app_logout')]
     public function logout(AuthenticationUtils $authenticationUtils) : void

33) /home/simondewendt/PhpstormProjects/CashAppSymfony/src/Component/User/Communication/Controller/LoginController.php:28    [M] PublicVisibility

--- Original
+++ New
@@ @@
         return $this->render('login/index.html.twig', ['controller_name' => 'LoginController', 'last_username' => $lastUsername, 'error' => $error]);
     }
     #[Route('/logout', name: 'app_logout')]
-    public function logout(AuthenticationUtils $authenticationUtils) : void
+    protected function logout(AuthenticationUtils $authenticationUtils) : void
     {
     }
 }
