[NoCoverage] MethodCallRemoval
Account/Communication/Controller/TransactionController.php:32:13
             $validateThis = $this->accountFacade->transformInput($_POST["amount"]);
             $balance = $this->accountFacade->calculateBalance($this->getLoggedInUser()->getId());
 
-            $this->accountFacade->validate($validateThis, $this->getLoggedInUser()->getId());
+            
 
             if ($receiver === null) {

[NoCoverage] Identical
Account/Communication/Controller/TransactionController.php:34:13
 
             $this->accountFacade->validate($validateThis, $this->getLoggedInUser()->getId());
 
-            if ($receiver === null) {
+            if ($receiver !== null) {
                 $error = "Empfänger existiert nicht! ";
             }

[NoCoverage] GreaterThan
Account/Communication/Controller/TransactionController.php:38:13
                 $error = "Empfänger existiert nicht! ";
             }
 
-            if ($validateThis > $balance) {
+            if ($validateThis >= $balance) {
                 $error = "Guthaben zu gering! ";
             }

[NoCoverage] GreaterThanNegotiation
Account/Communication/Controller/TransactionController.php:38:13
                 $error = "Empfänger existiert nicht! ";
             }
 
-            if ($validateThis > $balance) {
+            if ($validateThis <= $balance) {
                 $error = "Guthaben zu gering! ";
             }

[NoCoverage] Identical
Account/Communication/Controller/TransactionController.php:42:13
                 $error = "Guthaben zu gering! ";
             }
 
-            if ($error === null) {
+            if ($error !== null) {
                 $senderDTO = $this->accountFacade->findByUsername($this->accountFacade->getSessionUsername());
                 $receiverDTO = $receiver;

[NoCoverage] MethodCallRemoval
Account/Communication/Controller/TransactionController.php:47:17
                 $receiverDTO = $receiver;
                 $transaction = $this->accountFacade->prepareTransaction($validateThis, $senderDTO, $receiverDTO);
 
-                $this->accountFacade->saveDeposit($transaction["sender"]);
+                
                 $this->accountFacade->saveDeposit($transaction["receiver"]);
 

[NoCoverage] MethodCallRemoval
Account/Communication/Controller/TransactionController.php:48:17
                 $transaction = $this->accountFacade->prepareTransaction($validateThis, $senderDTO, $receiverDTO);
 
                 $this->accountFacade->saveDeposit($transaction["sender"]);
-                $this->accountFacade->saveDeposit($transaction["receiver"]);
+                
 
                 $success = "Die Transaction wurde erfolgreich durchgeführt!";
