[NoCoverage] PublicVisibility
Home/Communication/Controller/ErrorController.php:11:5
 
 class ErrorController extends AbstractController
 {
-    #[Route('/error', name: 'error')]
+    protected function action() : Response
     public function action(): Response
     {
