[NoCoverage] PublicVisibility
Home/Communication/Controller/HomeController.php:16:5
     {
     }
 
-    #[Route('/', name: 'app_home')]
+    protected function index() : Response
     public function index(): Response
     {
