[NoCoverage] PublicVisibility
User/Business/Model/UserInformation.php:24:5
         return $this->userRepository->byEmail($email);
     }
 
-    public function sessionUsername(): string
+    protected function sessionUsername() : string
     {
         return $this->findAndMap()->getUsername();

[NoCoverage] PublicVisibility
User/Business/Model/UserInformation.php:29:5
         return $this->findAndMap()->getUsername();
     }
 
-    public function sessionUserID(): int
+    protected function sessionUserID() : int
     {
         return $this->findAndMap()->getUserID();

[NoCoverage] PublicVisibility
User/Business/Model/UserInformation.php:39:5
         return $this->findAndMap() !== null;
     }
 
-    public function userByMail(string $email): ?UserDTO
+    protected function userByMail(string $email) : ?UserDTO
     {
         return $this->userRepository->byEmail($email);

[NoCoverage] PublicVisibility
User/Business/Model/UserInformation.php:44:5
         return $this->userRepository->byEmail($email);
     }
 
-    public function userByUsername(string $username): ?UserDTO
+    protected function userByUsername(string $username) : ?UserDTO
     {
         return $this->userRepository->byUsername($username);
