[NoCoverage] PublicVisibility
Component/User/Business/UserBusinessFacade.php:36:5
         $this->userEntityManager->create($userDTO);
     }
 
-    public function toEntity(UserDTO $userDTO): User
+    protected function toEntity(UserDTO $userDTO) : User
     {
         return $this->userMapper->dtoToEntity($userDTO);
