[NoCoverage] MethodCallRemoval
User/Communication/Controller/RegistrationController.php:33:13
             $plainPassword = $this->userBusinessFacade->toEntity($userFormData);
             $password = $passwordHasher->hashPassword($plainPassword, $plainPassword->getPassword());
             $save = $this->userBusinessFacade->prepareUser($userFormData->username, $userFormData->email, $password);
-            $this->userBusinessFacade->saveUser($save);
+            
 
             return $this->redirectToRoute('app_login');
