[NoCoverage] PublicVisibility
User/Persistence/Mapper/UserMapper.php:21:5
         return $userDTO;
     }
 
-    public function dtoToEntity(UserDTO $userDTO): User
+    protected function dtoToEntity(UserDTO $userDTO) : User
     {
         $user = new User();

[NoCoverage] MethodCallRemoval
User/Persistence/Mapper/UserMapper.php:24:9
     public function dtoToEntity(UserDTO $userDTO): User
     {
         $user = new User();
-        $user->setUsername($userDTO->username);
+        
         $user->setEmail($userDTO->email);
         $user->setPassword($userDTO->password);

[NoCoverage] MethodCallRemoval
User/Persistence/Mapper/UserMapper.php:25:9
     {
         $user = new User();
         $user->setUsername($userDTO->username);
-        $user->setEmail($userDTO->email);
+        
         $user->setPassword($userDTO->password);
 

[NoCoverage] MethodCallRemoval
User/Persistence/Mapper/UserMapper.php:26:9
         $user = new User();
         $user->setUsername($userDTO->username);
         $user->setEmail($userDTO->email);
-        $user->setPassword($userDTO->password);
+        
 
         return $user;
