[NoCoverage] PublicVisibility
Component/User/Persistence/UserEntityManager.php:18:5
     {
     }
 
-    public function create(UserDTO $userDTO): void
+    protected function create(UserDTO $userDTO) : void
     {
         $user = $this->userMapper->dtoToEntity($userDTO);

[NoCoverage] MethodCallRemoval
Component/User/Persistence/UserEntityManager.php:21:9
     public function create(UserDTO $userDTO): void
     {
         $user = $this->userMapper->dtoToEntity($userDTO);
-        $this->entityManager->persist($user);
+        
         $this->entityManager->flush();
     }
