[NoCoverage] PublicVisibility
Component/User/Persistence/UserRepository.php:17:5
     {
     }
 
-    public function byUsername(string $username): UserDTO
+    protected function byUsername(string $username) : UserDTO
     {
         $match = $this->userRepository->findBy(['username' => $username]);

[NoCoverage] IncrementInteger
Component/User/Persistence/UserRepository.php:20:9
     public function byUsername(string $username): UserDTO
     {
         $match = $this->userRepository->findBy(['username' => $username]);
-        return $this->userMapper->entityToDto($match[0]);
+        return $this->userMapper->entityToDto($match[1]);
     }
 
