[NoCoverage] PublicVisibility
DTO/DepositFormDTO.php:15:5
         return $this->value;
     }
 
-    public function setValue(?string $value): void
+    protected function setValue(?string $value) : void
     {
         $this->value = $value;
