[NoCoverage] PublicVisibility
DTO/TransactionDTO.php:18:5
         return $this->value;
     }
 
-    public function setValue(float $value): void
+    protected function setValue(float $value) : void
     {
         $this->value = $value;
