[NoCoverage] PublicVisibility
DTO/UserDTO.php:14:5
     public string $password = '';
 
     //Getters Setters
-    public function getPassword(): ?string
+    protected function getPassword() : ?string
     {
         return $this->password;

[NoCoverage] PublicVisibility
DTO/UserDTO.php:44:5
         $this->username = $username;
     }
 
-    public function getUserID(): int
+    protected function getUserID() : int
     {
         return $this->userID;
