[NoCoverage] MethodCallRemoval
DataFixtures/UserFixture.php:21:9
     public function load(ObjectManager $manager): void
     {
         $user = new User();
-        $user->setEmail('test@email.com');
+        
         $user->setUsername('testUser');
         $user->setPassword($this->userPasswordHasher->hashPassword($user, 'password'));

[NoCoverage] MethodCallRemoval
DataFixtures/UserFixture.php:22:9
     {
         $user = new User();
         $user->setEmail('test@email.com');
-        $user->setUsername('testUser');
+        
         $user->setPassword($this->userPasswordHasher->hashPassword($user, 'password'));
 

[NoCoverage] MethodCallRemoval
DataFixtures/UserFixture.php:23:9
         $user = new User();
         $user->setEmail('test@email.com');
         $user->setUsername('testUser');
-        $user->setPassword($this->userPasswordHasher->hashPassword($user, 'password'));
+        
 
         $manager->persist($user);

[NoCoverage] MethodCallRemoval
DataFixtures/UserFixture.php:25:9
         $user->setUsername('testUser');
         $user->setPassword($this->userPasswordHasher->hashPassword($user, 'password'));
 
-        $manager->persist($user);
+        
 
         $manager->flush();
