[NoCoverage] PublicVisibility
Entity/User.php:32:5
     #[ORM\Column]
     private array $roles = [];
 
-    public function setRoles(array $roles): void
+    protected function setRoles(array $roles) : void
     {
         $this->roles = $roles;

[NoCoverage] PublicVisibility
Entity/User.php:47:5
         return $this->username;
     }
 
-    public function setUsername(string $username): static
+    protected function setUsername(string $username) : static
     {
         $this->username = $username;
