[NoCoverage] MethodCallRemoval
Form/TransactionDTOType.php:18:9
 {
     public function buildForm(FormBuilderInterface $builder, array $options): void
     {
-        $builder
-            ->add('value', null, [
-                'constraints' => [
-                    new GreaterThanOrEqual([
-                        'value' => 0.10,
-                        'message' => 'Bitte mindestens 0.10€ einzahlen!',
-                    ]),
-                    new LessThanOrEqual([
-                        'value' => 50,
-                        'message' => 'Bitte maximal 50€ einzahlen! ',
-                    ]),
-                ],
-            ])
-            ->add('Hochladen', SubmitType::class);
+        
     }
 

[NoCoverage] ArrayItemRemoval
Form/TransactionDTOType.php:19:13
     public function buildForm(FormBuilderInterface $builder, array $options): void
     {
         $builder
-            ->add('value', null, [
-                'constraints' => [
-                    new GreaterThanOrEqual([
-                        'value' => 0.10,
-                        'message' => 'Bitte mindestens 0.10€ einzahlen!',
-                    ]),
-                    new LessThanOrEqual([
-                        'value' => 50,
-                        'message' => 'Bitte maximal 50€ einzahlen! ',
-                    ]),
-                ],
-            ])
+            $builder->add('value', null, [])->add('Hochladen', SubmitType::class);
             ->add('Hochladen', SubmitType::class);
     }

[NoCoverage] MethodCallRemoval
Form/TransactionDTOType.php:36:9
 
     public function configureOptions(OptionsResolver $resolver): void
     {
-        $resolver->setDefaults([
-            'data_class' => TransactionDTO::class,
-        ]);
+        
     }
 }
