[NoCoverage] Throw_
Symfony/AbstractController.php:15:13
     {
         $user = $this->getUser();
         if (!$user instanceof User) {
-            throw new \RuntimeException('user not logged in');
+            new \RuntimeException('user not logged in');
         }
 
