[Killed] PublicVisibility
Component/Account/Business/AccountBusinessFacade.php:31:5
     {
     }
 
-    public function getLoginStatus(): bool
+    protected function getLoginStatus() : bool
     {
         return $this->userInformation->loginStatus();
killedBy: App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
TypeError: Symfony\Bundle\FrameworkBundle\KernelBrowser::loginUser(): Argument #1 ($user) must be of type object, null given, called in /home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Communication/TransactionControllerTest.php on line 17

/home/simondewendt/PhpstormProjects/CashAp

[Killed] PublicVisibility
Component/Account/Business/AccountBusinessFacade.php:36:5
         return $this->userInformation->loginStatus();
     }
 
-    public function getSessionUsername(): string
+    protected function getSessionUsername() : string
     {
         return $this->userInformation->sessionUsername();
killedBy: App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testGetSessionUsername
statusReason: 1) App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testGetSessionUsername
Error: Call to protected method App\Component\Account\Business\AccountBusinessFacade::getSessionUsername() from scope App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/AccountBusinessFacadeTest.php:83

[Killed] PublicVisibility
Component/Account/Business/AccountBusinessFacade.php:41:5
         return $this->userInformation->sessionUsername();
     }
 
-    public function getSessionUserID(): int
+    protected function getSessionUserID() : int
     {
         return $this->userInformation->sessionUserID();
killedBy: App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testGetSessionUserID
statusReason: 1) App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testGetSessionUserID
Error: Call to protected method App\Component\Account\Business\AccountBusinessFacade::getSessionUserID() from scope App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/AccountBusinessFacadeTest.php:93

ER

[Killed] PublicVisibility
Component/Account/Business/AccountBusinessFacade.php:46:5
         return $this->userInformation->sessionUserID();
     }
 
-    public function calculateBalance(int $userID): float
+    protected function calculateBalance(int $userID) : float
     {
         return $this->balance->calculateBalance($userID);
killedBy: App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
TypeError: Symfony\Bundle\FrameworkBundle\KernelBrowser::loginUser(): Argument #1 ($user) must be of type object, null given, called in /home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Communication/TransactionControllerTest.php on line 17

/home/simondewendt/PhpstormProjects/CashAp

[Killed] PublicVisibility
Component/Account/Business/AccountBusinessFacade.php:51:5
         return $this->balance->calculateBalance($userID);
     }
 
-    public function transactionsPerUserID(int $userID): ?array
+    protected function transactionsPerUserID(int $userID) : ?array
     {
         return $this->transactionRepository->byUserID($userID);
killedBy: App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testTransactionsPerUserID
statusReason: 1) App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testTransactionsPerUserID
Error: Call to protected method App\Component\Account\Business\AccountBusinessFacade::transactionsPerUserID() from scope App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/AccountBusinessFacadeTest.

[Killed] PublicVisibility
Component/Account/Business/AccountBusinessFacade.php:56:5
         return $this->transactionRepository->byUserID($userID);
     }
 
-    public function findByMail(string $email): ?UserDTO
+    protected function findByMail(string $email) : ?UserDTO
     {
         return $this->userInformation->userByMail($email);
killedBy: App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testFindByMail
statusReason: 1) App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testFindByMail
Error: Call to protected method App\Component\Account\Business\AccountBusinessFacade::findByMail() from scope App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/AccountBusinessFacadeTest.php:141

ERRORS!
Tests

[Killed] PublicVisibility
Component/Account/Business/AccountBusinessFacade.php:61:5
         return $this->userInformation->userByMail($email);
     }
 
-    public function findByUsername(string $username): ?UserDTO
+    protected function findByUsername(string $username) : ?UserDTO
     {
         return $this->userInformation->userByUsername($username);
killedBy: App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testFindByUsername
statusReason: 1) App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testFindByUsername
Error: Call to protected method App\Component\Account\Business\AccountBusinessFacade::findByUsername() from scope App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/AccountBusinessFacadeTest.php:151

ERROR

[Killed] PublicVisibility
Component/Account/Business/AccountBusinessFacade.php:66:5
         return $this->userInformation->userByUsername($username);
     }
 
-    public function saveDeposit(TransactionDTO $accountDTO): void
+    protected function saveDeposit(TransactionDTO $accountDTO) : void
     {
         $this->transactionEntityManager->create($accountDTO);
killedBy: App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testSaveDeposit
statusReason: 1) App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testSaveDeposit
Error: Call to protected method App\Component\Account\Business\AccountBusinessFacade::saveDeposit() from scope App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/AccountBusinessFacadeTest.php:168

ERRORS!
Tes

[Killed] MethodCallRemoval
Component/Account/Business/AccountBusinessFacade.php:68:9
 
     public function saveDeposit(TransactionDTO $accountDTO): void
     {
-        $this->transactionEntityManager->create($accountDTO);
+        
     }
 
killedBy: App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testSaveDeposit
statusReason: 1) App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testSaveDeposit
Expectation failed for method name is "create" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Component/Account/Business/AccountBusinessFacade.php:71:5
         $this->transactionEntityManager->create($accountDTO);
     }
 
-    public function validate(float $value, int $userID): void
+    protected function validate(float $value, int $userID) : void
     {
         $this->accountValidation->collectErrors($value, $userID);
killedBy: App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testValidate
statusReason: 1) App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testValidate
Error: Call to protected method App\Component\Account\Business\AccountBusinessFacade::validate() from scope App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/AccountBusinessFacadeTest.php:205

ERRORS!
Tests: 1,

[Killed] MethodCallRemoval
Component/Account/Business/AccountBusinessFacade.php:73:9
 
     public function validate(float $value, int $userID): void
     {
-        $this->accountValidation->collectErrors($value, $userID);
+        
     }
 
killedBy: App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testValidate
statusReason: 1) App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testValidate
Expectation failed for method name is "collectErrors" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Component/Account/Business/AccountBusinessFacade.php:76:5
         $this->accountValidation->collectErrors($value, $userID);
     }
 
-    public function transformInput(string $input): float
+    protected function transformInput(string $input) : float
     {
         return $this->inputTransformer->transformInput($input);
killedBy: App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testTransformInput
statusReason: 1) App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testTransformInput
Error: Call to protected method App\Component\Account\Business\AccountBusinessFacade::transformInput() from scope App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/AccountBusinessFacadeTest.php:173

ERROR

[Killed] PublicVisibility
Component/Account/Business/AccountBusinessFacade.php:81:5
         return $this->inputTransformer->transformInput($input);
     }
 
-    public function prepareTransaction(float $value, UserDTO $userDTO, UserDTO $receiverDTO): array
+    protected function prepareTransaction(float $value, UserDTO $userDTO, UserDTO $receiverDTO) : array
     {
         return $this->setupTransaction->prepareTransaction($value, $userDTO, $receiverDTO);
killedBy: App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testPrepareTransaction
statusReason: 1) App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testPrepareTransaction
Error: Call to protected method App\Component\Account\Business\AccountBusinessFacade::prepareTransaction() from scope App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/AccountBusinessFacadeTest.php:18

[Killed] PublicVisibility
Component/Account/Business/AccountBusinessFacade.php:86:5
         return $this->setupTransaction->prepareTransaction($value, $userDTO, $receiverDTO);
     }
 
-    public function prepareDeposit(float $value, int $userID): TransactionDTO
+    protected function prepareDeposit(float $value, int $userID) : TransactionDTO
     {
         return $this->setupDeposit->prepareDeposit($value, $userID);
killedBy: App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testPrepareDeposit
statusReason: 1) App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testPrepareDeposit
Error: Call to protected method App\Component\Account\Business\AccountBusinessFacade::prepareDeposit() from scope App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/AccountBusinessFacadeTest.php:196

ERROR
