[Killed] OneZeroFloat
Account/Business/Model/Balance.php:15:9
 
     public function calculateBalance(int $userID): float
     {
-        $balance = 0.0;
+        $balance = 1.0;
         $transactions = $this->transactionRepository->byUserID($userID);
 
killedBy: App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalance
statusReason: 1) App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalance
Failed asserting that 11.0 is identical to 10.0.

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Model/BalanceTest.php:45

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Foreach_
Account/Business/Model/Balance.php:18:9
         $balance = 0.0;
         $transactions = $this->transactionRepository->byUserID($userID);
 
-        foreach ($transactions as $transaction) {
-            $balance += $transaction->value;
-        }
+        foreach (array() as $transaction) {
         return $balance;
     }
killedBy: App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalance
statusReason: 1) App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalance
Failed asserting that 0.0 is identical to 10.0.

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Model/BalanceTest.php:45

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Assignment
Account/Business/Model/Balance.php:19:13
         $transactions = $this->transactionRepository->byUserID($userID);
 
         foreach ($transactions as $transaction) {
-            $balance += $transaction->value;
+            $balance = $transaction->value;
         }
         return $balance;
killedBy: App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalance
statusReason: 1) App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalance
Failed asserting that 6.0 is identical to 10.0.

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Model/BalanceTest.php:45

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PlusEqual
Account/Business/Model/Balance.php:19:13
         $transactions = $this->transactionRepository->byUserID($userID);
 
         foreach ($transactions as $transaction) {
-            $balance += $transaction->value;
+            $balance -= $transaction->value;
         }
         return $balance;
killedBy: App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalance
statusReason: 1) App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalance
Failed asserting that -10.0 is identical to 10.0.

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Model/BalanceTest.php:45

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Account/Business/Model/Balance.php:24:5
         return $balance;
     }
 
-    public function calculateBalancePerHour(int $userID): float
+    protected function calculateBalancePerHour(int $userID) : float
     {
         $balance = 0.0;
killedBy: App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalancePerHour
statusReason: 1) App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalancePerHour
Error: Call to protected method App\Component\Account\Business\Model\Balance::calculateBalancePerHour() from scope App\Tests\src\Component\Account\Business\Model\BalanceTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Model/BalanceTest.php:73

ERRORS!
Tests: 1, As

[Killed] Foreach_
Account/Business/Model/Balance.php:32:9
         $currentTime = new \DateTime();
         $oneHourAgo = $currentTime->sub(new \DateInterval('PT1H'));
 
-        foreach ($transactions as $transaction) {
-            if ($transaction->createdAt > $oneHourAgo) {
-                $balance += $transaction->value;
-            }
-        }
+        foreach (array() as $transaction) {
         return $balance;
     }
killedBy: App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalancePerHour
statusReason: 1) App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalancePerHour
Failed asserting that 0.0 is identical to 10.0.

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Model/BalanceTest.php:73

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] GreaterThanNegotiation
Account/Business/Model/Balance.php:33:13
         $oneHourAgo = $currentTime->sub(new \DateInterval('PT1H'));
 
         foreach ($transactions as $transaction) {
-            if ($transaction->createdAt > $oneHourAgo) {
+            if ($transaction->createdAt <= $oneHourAgo) {
                 $balance += $transaction->value;
             }
killedBy: App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalancePerHour
statusReason: 1) App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalancePerHour
Failed asserting that 0.0 is identical to 10.0.

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Model/BalanceTest.php:73

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Survived] GreaterThan
Account/Business/Model/Balance.php:33:13
         $oneHourAgo = $currentTime->sub(new \DateInterval('PT1H'));
 
         foreach ($transactions as $transaction) {
-            if ($transaction->createdAt > $oneHourAgo) {
+            if ($transaction->createdAt >= $oneHourAgo) {
                 $balance += $transaction->value;
             }

[Killed] Assignment
Account/Business/Model/Balance.php:34:17
 
         foreach ($transactions as $transaction) {
             if ($transaction->createdAt > $oneHourAgo) {
-                $balance += $transaction->value;
+                $balance = $transaction->value;
             }
         }
killedBy: App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalancePerHour
statusReason: 1) App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalancePerHour
Failed asserting that 6.0 is identical to 10.0.

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Model/BalanceTest.php:73

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PlusEqual
Account/Business/Model/Balance.php:34:17
 
         foreach ($transactions as $transaction) {
             if ($transaction->createdAt > $oneHourAgo) {
-                $balance += $transaction->value;
+                $balance -= $transaction->value;
             }
         }
killedBy: App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalancePerHour
statusReason: 1) App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalancePerHour
Failed asserting that -10.0 is identical to 10.0.

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Model/BalanceTest.php:73

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Account/Business/Model/Balance.php:40:5
         return $balance;
     }
 
-    public function calculateBalancePerDay(int $userID): float
+    protected function calculateBalancePerDay(int $userID) : float
     {
         $balance = 0.0;
killedBy: App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalancePerDay
statusReason: 1) App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalancePerDay
Error: Call to protected method App\Component\Account\Business\Model\Balance::calculateBalancePerDay() from scope App\Tests\src\Component\Account\Business\Model\BalanceTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Model/BalanceTest.php:101

ERRORS!
Tests: 1, Ass

[Killed] Foreach_
Account/Business/Model/Balance.php:48:9
         $currentTime = new \DateTime();
         $oneDayAgo = $currentTime->sub(new \DateInterval('PT24H'));
 
-        foreach ($transactions as $transaction) {
-            if ($transaction->createdAt > $oneDayAgo) {
-                $balance += $transaction->value;
-            }
-        }
+        foreach (array() as $transaction) {
         return $balance;
     }
killedBy: App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalancePerDay
statusReason: 1) App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalancePerDay
Failed asserting that 0.0 is identical to 10.0.

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Model/BalanceTest.php:101

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] GreaterThanNegotiation
Account/Business/Model/Balance.php:49:13
         $oneDayAgo = $currentTime->sub(new \DateInterval('PT24H'));
 
         foreach ($transactions as $transaction) {
-            if ($transaction->createdAt > $oneDayAgo) {
+            if ($transaction->createdAt <= $oneDayAgo) {
                 $balance += $transaction->value;
             }
killedBy: App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalancePerDay
statusReason: 1) App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalancePerDay
Failed asserting that 0.0 is identical to 10.0.

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Model/BalanceTest.php:101

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Survived] GreaterThan
Account/Business/Model/Balance.php:49:13
         $oneDayAgo = $currentTime->sub(new \DateInterval('PT24H'));
 
         foreach ($transactions as $transaction) {
-            if ($transaction->createdAt > $oneDayAgo) {
+            if ($transaction->createdAt >= $oneDayAgo) {
                 $balance += $transaction->value;
             }

[Killed] Assignment
Account/Business/Model/Balance.php:50:17
 
         foreach ($transactions as $transaction) {
             if ($transaction->createdAt > $oneDayAgo) {
-                $balance += $transaction->value;
+                $balance = $transaction->value;
             }
         }
killedBy: App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalancePerDay
statusReason: 1) App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalancePerDay
Failed asserting that 6.0 is identical to 10.0.

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Model/BalanceTest.php:101

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PlusEqual
Account/Business/Model/Balance.php:50:17
 
         foreach ($transactions as $transaction) {
             if ($transaction->createdAt > $oneDayAgo) {
-                $balance += $transaction->value;
+                $balance -= $transaction->value;
             }
         }
killedBy: App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalancePerDay
statusReason: 1) App\Tests\src\Component\Account\Business\Model\BalanceTest::testCalculateBalancePerDay
Failed asserting that -10.0 is identical to 10.0.

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Model/BalanceTest.php:101

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
