[Killed] PublicVisibility
Account/Business/Model/InputTransformer.php:7:5
 
 class InputTransformer
 {
-    public function transformInput(string $input): float
+    protected function transformInput(string $input) : float
     {
         $amount = str_replace(['.', ','], ['', '.'], $input);
killedBy: App\Tests\src\Component\Account\Business\Model\InputTransformerTest::testTransformInput
statusReason: 1) App\Tests\src\Component\Account\Business\Model\InputTransformerTest::testTransformInput
Error: Call to protected method App\Component\Account\Business\Model\InputTransformer::transformInput() from scope App\Tests\src\Component\Account\Business\Model\InputTransformerTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Model/InputTransformerTest.php:20

ER

[Killed] UnwrapStrReplace
Account/Business/Model/InputTransformer.php:9:9
 {
     public function transformInput(string $input): float
     {
-        $amount = str_replace(['.', ','], ['', '.'], $input);
+        $amount = $input;
         return (float)$amount;
     }
killedBy: App\Tests\src\Component\Account\Business\Model\InputTransformerTest::testTransformInput
statusReason: 1) App\Tests\src\Component\Account\Business\Model\InputTransformerTest::testTransformInput
Failed asserting that 1.0 is identical to 1000.0.

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Model/InputTransformerTest.php:27

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] ArrayItemRemoval
Account/Business/Model/InputTransformer.php:9:9
 {
     public function transformInput(string $input): float
     {
-        $amount = str_replace(['.', ','], ['', '.'], $input);
+        $amount = str_replace(['.', ','], ['.'], $input);
         return (float)$amount;
     }
killedBy: App\Tests\src\Component\Account\Business\Model\InputTransformerTest::testTransformInput
statusReason: 1) App\Tests\src\Component\Account\Business\Model\InputTransformerTest::testTransformInput
Failed asserting that 1.0 is identical to 1000.0.

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Model/InputTransformerTest.php:27

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] CastFloat
Account/Business/Model/InputTransformer.php:10:9
     public function transformInput(string $input): float
     {
         $amount = str_replace(['.', ','], ['', '.'], $input);
-        return (float)$amount;
+        return $amount;
     }
 }
killedBy: App\Tests\src\Component\Account\Business\Model\InputTransformerTest::testTransformInput
statusReason: 1) App\Tests\src\Component\Account\Business\Model\InputTransformerTest::testTransformInput
TypeError: App\Component\Account\Business\Model\InputTransformer::transformInput(): Return value must be of type float, string returned

/home/simondewendt/PhpstormProjects/CashAppSymfony/src/Component/Account/Business/Model/InputTransformer.php:11
/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src
