[Killed] PublicVisibility
Account/Business/Model/SetupDeposit.php:9:5
 
 class SetupDeposit
 {
-    public function prepareDeposit(float $value, int $userID): TransactionDTO
+    protected function prepareDeposit(float $value, int $userID) : TransactionDTO
     {
         $accountDTO = new TransactionDTO();
killedBy: App\Tests\src\Component\Account\Business\Model\SetupDepositTest::testSetupDeposit
statusReason: 1) App\Tests\src\Component\Account\Business\Model\SetupDepositTest::testSetupDeposit
Error: Call to protected method App\Component\Account\Business\Model\SetupDeposit::prepareDeposit() from scope App\Tests\src\Component\Account\Business\Model\SetupDepositTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Model/SetupDepositTest.php:22

ERRORS!
Tests: 1, As
