[Killed] PublicVisibility
Account/Business/Model/SetupTransaction.php:10:5
 
 class SetupTransaction
 {
-    public function prepareTransaction(float $value, UserDTO $userDTO, UserDTO $receiverDTO): array
+    protected function prepareTransaction(float $value, UserDTO $userDTO, UserDTO $receiverDTO) : array
     {
         $sender = new TransactionDTO();
killedBy: App\Tests\src\Component\Account\Business\Model\SetupTransactionTest::testSetupTransaction
statusReason: 1) App\Tests\src\Component\Account\Business\Model\SetupTransactionTest::testSetupTransaction
Error: Call to protected method App\Component\Account\Business\Model\SetupTransaction::prepareTransaction() from scope App\Tests\src\Component\Account\Business\Model\SetupTransactionTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Model/SetupTransactionTest.php:

[Survived] ConcatOperandRemoval
Account/Business/Model/SetupTransaction.php:16:9
         $receiver = new TransactionDTO();
 
         $sender->userID = $userDTO->userID;
-        $sender->purpose = 'Geldtransfer an ' . $receiverDTO->username;
+        $sender->purpose = 'Geldtransfer an ';
         $sender->createdAt = new \DateTime();
         $sender->value = $value * (-1);

[Survived] ConcatOperandRemoval
Account/Business/Model/SetupTransaction.php:16:9
         $receiver = new TransactionDTO();
 
         $sender->userID = $userDTO->userID;
-        $sender->purpose = 'Geldtransfer an ' . $receiverDTO->username;
+        $sender->purpose = $receiverDTO->username;
         $sender->createdAt = new \DateTime();
         $sender->value = $value * (-1);

[Survived] DecrementInteger
Account/Business/Model/SetupTransaction.php:18:9
         $sender->userID = $userDTO->userID;
         $sender->purpose = 'Geldtransfer an ' . $receiverDTO->username;
         $sender->createdAt = new \DateTime();
-        $sender->value = $value * (-1);
+        $sender->value = $value * -2;
 
         $receiver->userID = $receiverDTO->userID;

[Survived] IncrementInteger
Account/Business/Model/SetupTransaction.php:18:9
         $sender->userID = $userDTO->userID;
         $sender->purpose = 'Geldtransfer an ' . $receiverDTO->username;
         $sender->createdAt = new \DateTime();
-        $sender->value = $value * (-1);
+        $sender->value = $value * -0;
 
         $receiver->userID = $receiverDTO->userID;

[Survived] ConcatOperandRemoval
Account/Business/Model/SetupTransaction.php:21:9
         $sender->value = $value * (-1);
 
         $receiver->userID = $receiverDTO->userID;
-        $receiver->purpose = 'Zahlung erhalten von ' . $userDTO->username;
+        $receiver->purpose = $userDTO->username;
         $receiver->createdAt = new \DateTime();
         $receiver->value = $value;

[Survived] Concat
Account/Business/Model/SetupTransaction.php:21:9
         $sender->value = $value * (-1);
 
         $receiver->userID = $receiverDTO->userID;
-        $receiver->purpose = 'Zahlung erhalten von ' . $userDTO->username;
+        $receiver->purpose = $userDTO->username . 'Zahlung erhalten von ';
         $receiver->createdAt = new \DateTime();
         $receiver->value = $value;
