[Killed] PublicVisibility
Account/Business/Validation/AccountValidation.php:15:5
         $this->validationCollection = $validations;
     }
 
-    public function collectErrors(float $amount, int $userID): void
+    protected function collectErrors(float $amount, int $userID) : void
     {
         $firstError = null;
killedBy: App\Tests\src\Component\Account\Business\Validation\AccountValidationTest::testValidateSingle
statusReason: 1) App\Tests\src\Component\Account\Business\Validation\AccountValidationTest::testValidateSingle
Error: Call to protected method App\Component\Account\Business\Validation\AccountValidation::collectErrors() from scope App\Tests\src\Component\Account\Business\Validation\AccountValidationTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Validation/AccountVa

[Killed] Foreach_
Account/Business/Validation/AccountValidation.php:19:9
     {
         $firstError = null;
 
-        foreach ($this->validationCollection as $validator) {
-            try {
-                $validator->validate($amount, $userID);
-            } catch (AccountValidationException $e) {
-                if ($firstError === null) {
-                    $firstError = $e;
-                }
-            }
-        }
+        foreach (array() as $validator) {
 
         if ($firstError !== null) {
killedBy: App\Tests\src\Component\Account\Business\Validation\AccountValidationTest::testValidateSingle
statusReason: 1) App\Tests\src\Component\Account\Business\Validation\AccountValidationTest::testValidateSingle
Undefined variable $error

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Validation/AccountValidationTest.php:35

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
Account/Business/Validation/AccountValidation.php:21:17
 
         foreach ($this->validationCollection as $validator) {
             try {
-                $validator->validate($amount, $userID);
+                
             } catch (AccountValidationException $e) {
                 if ($firstError === null) {
killedBy: App\Tests\src\Component\Account\Business\Validation\AccountValidationTest::testValidateSingle
statusReason: 1) App\Tests\src\Component\Account\Business\Validation\AccountValidationTest::testValidateSingle
Undefined variable $error

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Validation/AccountValidationTest.php:35

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Identical
Account/Business/Validation/AccountValidation.php:23:17
             try {
                 $validator->validate($amount, $userID);
             } catch (AccountValidationException $e) {
-                if ($firstError === null) {
+                if ($firstError !== null) {
                     $firstError = $e;
                 }
killedBy: App\Tests\src\Component\Account\Business\Validation\AccountValidationTest::testValidateSingle
statusReason: 1) App\Tests\src\Component\Account\Business\Validation\AccountValidationTest::testValidateSingle
Undefined variable $error

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Validation/AccountValidationTest.php:35

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] NotIdentical
Account/Business/Validation/AccountValidation.php:29:9
             }
         }
 
-        if ($firstError !== null) {
+        if ($firstError === null) {
             throw $firstError;
         }
killedBy: App\Tests\src\Component\Account\Business\Validation\AccountValidationTest::testValidateSingle
statusReason: 1) App\Tests\src\Component\Account\Business\Validation\AccountValidationTest::testValidateSingle
Undefined variable $error

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Validation/AccountValidationTest.php:35

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Throw_
Account/Business/Validation/AccountValidation.php:30:13
         }
 
         if ($firstError !== null) {
-            throw $firstError;
+            $firstError;
         }
     }
killedBy: App\Tests\src\Component\Account\Business\Validation\AccountValidationTest::testValidateSingle
statusReason: 1) App\Tests\src\Component\Account\Business\Validation\AccountValidationTest::testValidateSingle
Undefined variable $error

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Validation/AccountValidationTest.php:35

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
