[Survived] Plus
Account/Business/Validation/DayValidator.php:16:9
     public function validate(float $amount, int $userID): void
     {
         $dayBalance = $this->balance->calculateBalancePerDay($userID);
-        $limit = $dayBalance + $amount;
+        $limit = $dayBalance - $amount;
 
         if ($limit > 500.0) {

[Survived] GreaterThanNegotiation
Account/Business/Validation/DayValidator.php:18:9
         $dayBalance = $this->balance->calculateBalancePerDay($userID);
         $limit = $dayBalance + $amount;
 
-        if ($limit > 500.0) {
+        if ($limit <= 500.0) {
             throw new AccountValidationException('Tägliches Einzahlungslimit von 500€ überschritten!');
         }

[Survived] GreaterThan
Account/Business/Validation/DayValidator.php:18:9
         $dayBalance = $this->balance->calculateBalancePerDay($userID);
         $limit = $dayBalance + $amount;
 
-        if ($limit > 500.0) {
+        if ($limit >= 500.0) {
             throw new AccountValidationException('Tägliches Einzahlungslimit von 500€ überschritten!');
         }

[Survived] Throw_
Account/Business/Validation/DayValidator.php:19:13
         $limit = $dayBalance + $amount;
 
         if ($limit > 500.0) {
-            throw new AccountValidationException('Tägliches Einzahlungslimit von 500€ überschritten!');
+            new AccountValidationException('Tägliches Einzahlungslimit von 500€ überschritten!');
         }
     }
