[Survived] Plus
Account/Business/Validation/HourValidator.php:16:9
     public function validate(float $amount, int $userID): void
     {
         $hourBalance = $this->balance->calculateBalancePerHour($userID);
-        $limit = $hourBalance + $amount;
+        $limit = $hourBalance - $amount;
 
         if ($limit > 100.0) {

[Survived] GreaterThanNegotiation
Account/Business/Validation/HourValidator.php:18:9
         $hourBalance = $this->balance->calculateBalancePerHour($userID);
         $limit = $hourBalance + $amount;
 
-        if ($limit > 100.0) {
+        if ($limit <= 100.0) {
             throw new AccountValidationException('Stündliches Einzahlungslimit von 100€ überschritten!');
         }

[Survived] GreaterThan
Account/Business/Validation/HourValidator.php:18:9
         $hourBalance = $this->balance->calculateBalancePerHour($userID);
         $limit = $hourBalance + $amount;
 
-        if ($limit > 100.0) {
+        if ($limit >= 100.0) {
             throw new AccountValidationException('Stündliches Einzahlungslimit von 100€ überschritten!');
         }

[Survived] Throw_
Account/Business/Validation/HourValidator.php:19:13
         $limit = $hourBalance + $amount;
 
         if ($limit > 100.0) {
-            throw new AccountValidationException('Stündliches Einzahlungslimit von 100€ überschritten!');
+            new AccountValidationException('Stündliches Einzahlungslimit von 100€ überschritten!');
         }
     }
