[Killed] LogicalOrNegation
Account/Business/Validation/SingleValidator.php:9:9
 {
     public function validate(float $amount, int $userID): void
     {
-        if ($amount < 0.01 || $amount > 50) {
+        if (!($amount < 0.01 || $amount > 50)) {
             throw new AccountValidationException('Bitte einen Betrag von mindestens 0.01€ und maximal 50€ eingeben!');
         }
killedBy: App\Tests\src\Component\Account\Business\Validation\AccountValidationTest::testValidateSingle
statusReason: 1) App\Tests\src\Component\Account\Business\Validation\AccountValidationTest::testValidateSingle
Failed asserting that 'Stündliches Einzahlungslimit von 100€ überschritten!' contains "Bitte einen Betrag von mindestens 0.01€ und maximal 50€ eingeben!".

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Validation/AccountValidationTest.php:35

FAILURES!
Tests: 1

[Killed] GreaterThanNegotiation
Account/Business/Validation/SingleValidator.php:9:9
 {
     public function validate(float $amount, int $userID): void
     {
-        if ($amount < 0.01 || $amount > 50) {
+        if ($amount < 0.01 || $amount <= 50) {
             throw new AccountValidationException('Bitte einen Betrag von mindestens 0.01€ und maximal 50€ eingeben!');
         }
killedBy: App\Tests\src\Component\Account\Business\Validation\AccountValidationTest::testValidateSingle
statusReason: 1) App\Tests\src\Component\Account\Business\Validation\AccountValidationTest::testValidateSingle
Failed asserting that 'Stündliches Einzahlungslimit von 100€ überschritten!' contains "Bitte einen Betrag von mindestens 0.01€ und maximal 50€ eingeben!".

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Validation/AccountValidationTest.php:35

FAILURES!
Tests: 1

[Killed] Throw_
Account/Business/Validation/SingleValidator.php:10:13
     public function validate(float $amount, int $userID): void
     {
         if ($amount < 0.01 || $amount > 50) {
-            throw new AccountValidationException('Bitte einen Betrag von mindestens 0.01€ und maximal 50€ eingeben!');
+            new AccountValidationException('Bitte einen Betrag von mindestens 0.01€ und maximal 50€ eingeben!');
         }
     }
killedBy: App\Tests\src\Component\Account\Business\Validation\AccountValidationTest::testValidateSingle
statusReason: 1) App\Tests\src\Component\Account\Business\Validation\AccountValidationTest::testValidateSingle
Failed asserting that 'Stündliches Einzahlungslimit von 100€ überschritten!' contains "Bitte einen Betrag von mindestens 0.01€ und maximal 50€ eingeben!".

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/Validation/AccountValidationTest.php:35

FAILURES!
Tests: 1
