[Killed] PublicVisibility
Account/Communication/Controller/HistoryController.php:16:5
     {
     }
 
-    #[Route('/history', name: 'history')]
+    protected function action() : Response
     public function action(): Response
     {
killedBy: App\Tests\src\Component\Account\Communication\HistoryControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\HistoryControllerTest::testAction
TypeError: Symfony\Bundle\FrameworkBundle\KernelBrowser::loginUser(): Argument #1 ($user) must be of type object, null given, called in /home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Communication/HistoryControllerTest.php on line 19

/home/simondewendt/PhpstormProjects/CashAppSymfony

[Killed] ArrayItemRemoval
Account/Communication/Controller/HistoryController.php:21:9
     {
         $transactions = $this->accountBusinessFacade->transactionsPerUserID($this->getLoggedInUser()->getId());
 
-        return $this->render('history.html.twig', [
-            'title' => 'History Controller',
-            'transactions' => $transactions,
-        ]);
+        return $this->render('history.html.twig', ['transactions' => $transactions]);
     }
 }
killedBy: App\Tests\src\Component\Account\Communication\HistoryControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\HistoryControllerTest::testAction
TypeError: Symfony\Bundle\FrameworkBundle\KernelBrowser::loginUser(): Argument #1 ($user) must be of type object, null given, called in /home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Communication/HistoryControllerTest.php on line 19

/home/simondewendt/PhpstormProjects/CashAppSymfony
