[Killed] PublicVisibility
Account/Communication/Controller/NewDepositController.php:23:5
     {
     }
 
-    #[Route('/deposit', name: 'deposit')]
+    protected function action(Request $request) : Response
     public function action(Request $request): Response
     {
killedBy: App\Tests\src\Component\Account\Communication\DepositControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\DepositControllerTest::testAction
TypeError: Symfony\Bundle\FrameworkBundle\KernelBrowser::loginUser(): Argument #1 ($user) must be of type object, null given, called in /home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Communication/DepositControllerTest.php on line 17

/home/simondewendt/PhpstormProjects/CashAppSymfony
