[Killed] PublicVisibility
Account/Persistence/Mapper/TransactionMapper.php:10:5
 
 class TransactionMapper
 {
-    public function entityToDto(Transaction $transaction): TransactionDTO
+    protected function entityToDto(Transaction $transaction) : TransactionDTO
     {
         $accountDTO = new TransactionDTO();
killedBy: App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testEntityToDto
statusReason: 1) App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testEntityToDto
Error: Call to protected method App\Component\Account\Persistence\Mapper\TransactionMapper::entityToDto() from scope App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Persistence/Mapper/TransactionMapperT

[Killed] PublicVisibility
Account/Persistence/Mapper/TransactionMapper.php:22:5
         return $accountDTO;
     }
 
-    public function dtoToEntity(TransactionDTO $accountDTO): Transaction
+    protected function dtoToEntity(TransactionDTO $accountDTO) : Transaction
     {
         $transaction = new Transaction();
killedBy: App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testDtoToEntity
statusReason: 1) App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testDtoToEntity
Error: Call to protected method App\Component\Account\Persistence\Mapper\TransactionMapper::dtoToEntity() from scope App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Persistence/Mapper/TransactionMapperT

[Killed] MethodCallRemoval
Account/Persistence/Mapper/TransactionMapper.php:25:9
     public function dtoToEntity(TransactionDTO $accountDTO): Transaction
     {
         $transaction = new Transaction();
-        $transaction->setValue($accountDTO->value);
+        
         $transaction->setUserID($accountDTO->userID);
         $transaction->setCreatedAt($accountDTO->createdAt);
killedBy: App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testDtoToEntity
statusReason: 1) App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testDtoToEntity
Failed asserting that null is identical to 1.0.

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Persistence/Mapper/TransactionMapperTest.php:49

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Account/Persistence/Mapper/TransactionMapper.php:26:9
     {
         $transaction = new Transaction();
         $transaction->setValue($accountDTO->value);
-        $transaction->setUserID($accountDTO->userID);
+        
         $transaction->setCreatedAt($accountDTO->createdAt);
         $transaction->setPurpose($accountDTO->purpose);
killedBy: App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testDtoToEntity
statusReason: 1) App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testDtoToEntity
Failed asserting that null is identical to 1.

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Persistence/Mapper/TransactionMapperTest.php:50

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] MethodCallRemoval
Account/Persistence/Mapper/TransactionMapper.php:27:9
         $transaction = new Transaction();
         $transaction->setValue($accountDTO->value);
         $transaction->setUserID($accountDTO->userID);
-        $transaction->setCreatedAt($accountDTO->createdAt);
+        
         $transaction->setPurpose($accountDTO->purpose);
 
killedBy: App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testDtoToEntity
statusReason: 1) App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testDtoToEntity
Failed asserting that null is identical to an object of class "DateTime".

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Persistence/Mapper/TransactionMapperTest.php:51

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Account/Persistence/Mapper/TransactionMapper.php:28:9
         $transaction->setValue($accountDTO->value);
         $transaction->setUserID($accountDTO->userID);
         $transaction->setCreatedAt($accountDTO->createdAt);
-        $transaction->setPurpose($accountDTO->purpose);
+        
 
         return $transaction;
killedBy: App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testDtoToEntity
statusReason: 1) App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testDtoToEntity
Failed asserting that null is identical to 'testing'.

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Persistence/Mapper/TransactionMapperTest.php:52

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.
