[Killed] PublicVisibility
Component/Account/Persistence/TransactionEntityManager.php:19:5
     {
     }
 
-    public function create(TransactionDTO $accountDTO): void
+    protected function create(TransactionDTO $accountDTO) : void
     {
         $transaction = $this->transactionMapper->dtoToEntity($accountDTO);
killedBy: App\Tests\src\Component\Account\Persistence\TransactionEntityManagerTest::testCreate
statusReason: 1) App\Tests\src\Component\Account\Persistence\TransactionEntityManagerTest::testCreate
Error: Call to protected method App\Component\Account\Persistence\TransactionEntityManager::create() from scope App\Tests\src\Component\Account\Persistence\TransactionEntityManagerTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Persistence/TransactionEntityManagerTest.php:45

[Survived] MethodCallRemoval
Component/Account/Persistence/TransactionEntityManager.php:22:9
     public function create(TransactionDTO $accountDTO): void
     {
         $transaction = $this->transactionMapper->dtoToEntity($accountDTO);
-        $this->entityManager->persist($transaction);
+        
         $this->entityManager->flush();
     }

[Survived] MethodCallRemoval
Component/Account/Persistence/TransactionEntityManager.php:23:9
     {
         $transaction = $this->transactionMapper->dtoToEntity($accountDTO);
         $this->entityManager->persist($transaction);
-        $this->entityManager->flush();
+        
     }
 }
