[Killed] PublicVisibility
Component/Account/Persistence/TransactionRepository.php:16:5
     {
     }
 
-    public function byUserID(int $id): ?array
+    protected function byUserID(int $id) : ?array
     {
         $userTransactions = [];
killedBy: App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
TypeError: Symfony\Bundle\FrameworkBundle\KernelBrowser::loginUser(): Argument #1 ($user) must be of type object, null given, called in /home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Communication/TransactionControllerTest.php on line 17

/home/simondewendt/PhpstormProjects/CashAp

[Killed] Foreach_
Component/Account/Persistence/TransactionRepository.php:21:9
         $userTransactions = [];
         $matches = $this->transactionRepository->findBy(['userID' => $id]);
 
-        foreach ($matches as $entry) {
-            $userTransactions[] = $this->transactionMapper->entityToDto($entry);
-        }
+        foreach (array() as $entry) {
 
         return $userTransactions;
killedBy: App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
TypeError: Symfony\Bundle\FrameworkBundle\KernelBrowser::loginUser(): Argument #1 ($user) must be of type object, null given, called in /home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Communication/TransactionControllerTest.php on line 17

/home/simondewendt/PhpstormProjects/CashAp
