[Killed] PublicVisibility
User/Business/Model/SetupUser.php:9:5
 
 class SetupUser
 {
-    public function prepareUser(string $username, string $email, string $password): UserDTO
+    protected function prepareUser(string $username, string $email, string $password) : UserDTO
     {
         $userDTO = new UserDTO();
killedBy: App\Tests\src\Component\User\Business\UserBusinessFacadeTest::testPrepareUser
statusReason: 1) App\Tests\src\Component\User\Business\UserBusinessFacadeTest::testPrepareUser
Error: Call to protected method App\Component\User\Business\Model\SetupUser::prepareUser() from scope App\Component\User\Business\UserBusinessFacade

/home/simondewendt/PhpstormProjects/CashAppSymfony/src/Component/User/Business/UserBusinessFacade.php:28
/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Com
