[Killed] PublicVisibility
User/Business/Model/UserInformation.php:18:5
     {
     }
 
-    public function findAndMap(): ?UserDTO
+    protected function findAndMap() : ?UserDTO
     {
         $email = $this->security->getUser()->getUserIdentifier();
killedBy: App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
TypeError: Symfony\Bundle\FrameworkBundle\KernelBrowser::loginUser(): Argument #1 ($user) must be of type object, null given, called in /home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Communication/TransactionControllerTest.php on line 17

/home/simondewendt/PhpstormProjects/CashAp

[Killed] PublicVisibility
User/Business/Model/UserInformation.php:34:5
         return $this->findAndMap()->getUserID();
     }
 
-    public function loginStatus(): bool
+    protected function loginStatus() : bool
     {
         return $this->findAndMap() !== null;
killedBy: App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
TypeError: Symfony\Bundle\FrameworkBundle\KernelBrowser::loginUser(): Argument #1 ($user) must be of type object, null given, called in /home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Communication/TransactionControllerTest.php on line 17

/home/simondewendt/PhpstormProjects/CashAp

[Killed] NotIdentical
User/Business/Model/UserInformation.php:36:9
 
     public function loginStatus(): bool
     {
-        return $this->findAndMap() !== null;
+        return $this->findAndMap() === null;
     }
 
killedBy: App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
TypeError: Symfony\Bundle\FrameworkBundle\KernelBrowser::loginUser(): Argument #1 ($user) must be of type object, null given, called in /home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Communication/TransactionControllerTest.php on line 17

/home/simondewendt/PhpstormProjects/CashAp
