[Killed] PublicVisibility
Component/User/Business/UserBusinessFacade.php:21:5
     {
     }
 
-    public function validate(): bool
+    protected function validate() : bool
     {
         return true;
killedBy: App\Tests\src\Component\User\Business\UserBusinessFacadeTest::testValidate
statusReason: 1) App\Tests\src\Component\User\Business\UserBusinessFacadeTest::testValidate
Error: Call to protected method App\Component\User\Business\UserBusinessFacade::validate() from scope App\Tests\src\Component\User\Business\UserBusinessFacadeTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/User/Business/UserBusinessFacadeTest.php:39

ERRORS!
Tests: 1, Assertions: 0, Errors: 1

[Killed] PublicVisibility
Component/User/Business/UserBusinessFacade.php:26:5
         return true;
     }
 
-    public function prepareUser(string $username, string $email, string $password): UserDTO
+    protected function prepareUser(string $username, string $email, string $password) : UserDTO
     {
         return $this->setupUser->prepareUser($username, $email, $password);
killedBy: App\Tests\src\Component\User\Business\UserBusinessFacadeTest::testPrepareUser
statusReason: 1) App\Tests\src\Component\User\Business\UserBusinessFacadeTest::testPrepareUser
Error: Call to protected method App\Component\User\Business\UserBusinessFacade::prepareUser() from scope App\Tests\src\Component\User\Business\UserBusinessFacadeTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/User/Business/UserBusinessFacadeTest.php:48

ERRORS!
Tests: 1, Assertions: 0, Err

[Killed] PublicVisibility
Component/User/Business/UserBusinessFacade.php:31:5
         return $this->setupUser->prepareUser($username, $email, $password);
     }
 
-    public function saveUser(UserDTO $userDTO): void
+    protected function saveUser(UserDTO $userDTO) : void
     {
         $this->userEntityManager->create($userDTO);
killedBy: App\Tests\src\Component\User\Business\UserBusinessFacadeTest::testSaveUser
statusReason: 1) App\Tests\src\Component\User\Business\UserBusinessFacadeTest::testSaveUser
Error: Call to protected method App\Component\User\Business\UserBusinessFacade::saveUser() from scope App\Tests\src\Component\User\Business\UserBusinessFacadeTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/User/Business/UserBusinessFacadeTest.php:62

ERRORS!
Tests: 1, Assertions: 0, Errors: 1

[Killed] MethodCallRemoval
Component/User/Business/UserBusinessFacade.php:33:9
 
     public function saveUser(UserDTO $userDTO): void
     {
-        $this->userEntityManager->create($userDTO);
+        
     }
 
killedBy: App\Tests\src\Component\User\Business\UserBusinessFacadeTest::testSaveUser
statusReason: 1) App\Tests\src\Component\User\Business\UserBusinessFacadeTest::testSaveUser
Expectation failed for method name is "create" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
