[Killed] PublicVisibility
User/Communication/Controller/RegistrationController.php:20:5
     {
     }
 
-    #[Route('/registration', name: 'registration')]
+    protected function action(Request $request, UserPasswordHasherInterface $passwordHasher) : Response
     public function action(Request $request, UserPasswordHasherInterface $passwordHasher): Response
     {
killedBy: App\Tests\src\Component\User\Communication\RegistrationControllerTest::testAction
statusReason: 1) App\Tests\src\Component\User\Communication\RegistrationControllerTest::testAction
Failed asserting that '<!-- The controller for URI &quot;/registration&quot; is not callable: Method &quot;action&quot; on class &quot;App\Component\User\Communication\Controller\RegistrationController&quot; should be public and non-abstract. (500 Internal Server Error) -->\n
<!DOCTYPE html>\n
<html lang="en">\n

[Survived] MethodCallRemoval
User/Communication/Controller/RegistrationController.php:26:9
         $errors = null;
 
         $form = $this->createForm(UserDTOType::class);
-        $form->handleRequest($request);
+        
 
         if ($form->isSubmitted() && $form->isValid()) {

[Killed] LogicalAnd
User/Communication/Controller/RegistrationController.php:28:9
         $form = $this->createForm(UserDTOType::class);
         $form->handleRequest($request);
 
-        if ($form->isSubmitted() && $form->isValid()) {
+        if ($form->isSubmitted() || $form->isValid()) {
             $userFormData = $form->getData();
             $plainPassword = $this->userBusinessFacade->toEntity($userFormData);
killedBy: App\Tests\src\Component\User\Communication\RegistrationControllerTest::testAction
statusReason: 1) App\Tests\src\Component\User\Communication\RegistrationControllerTest::testAction
Failed asserting that '<!-- Cannot check if an unsubmitted form is valid. Call Form::isSubmitted() and ensure that it's true before calling Form::isValid(). (500 Internal Server Error) -->\n
<!DOCTYPE html>\n
<html lang="en">\n
    <head>\n
        <meta charset="UTF-8" />\n
        <meta name="robots" content="no

[Killed] LogicalAndSingleSubExprNegation
User/Communication/Controller/RegistrationController.php:28:9
         $form = $this->createForm(UserDTOType::class);
         $form->handleRequest($request);
 
-        if ($form->isSubmitted() && $form->isValid()) {
+        if (!$form->isSubmitted() && $form->isValid()) {
             $userFormData = $form->getData();
             $plainPassword = $this->userBusinessFacade->toEntity($userFormData);
killedBy: App\Tests\src\Component\User\Communication\RegistrationControllerTest::testAction
statusReason: 1) App\Tests\src\Component\User\Communication\RegistrationControllerTest::testAction
Failed asserting that '<!-- Cannot check if an unsubmitted form is valid. Call Form::isSubmitted() and ensure that it's true before calling Form::isValid(). (500 Internal Server Error) -->\n
<!DOCTYPE html>\n
<html lang="en">\n
    <head>\n
        <meta charset="UTF-8" />\n
        <meta name="robots" content="no
