[Killed] PublicVisibility
User/Persistence/Mapper/UserMapper.php:10:5
 
 class UserMapper
 {
-    public function entityToDto(User $user): UserDTO
+    protected function entityToDto(User $user) : UserDTO
     {
         $userDTO = new UserDTO();
killedBy: App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
TypeError: Symfony\Bundle\FrameworkBundle\KernelBrowser::loginUser(): Argument #1 ($user) must be of type object, null given, called in /home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Communication/TransactionControllerTest.php on line 17

/home/simondewendt/PhpstormProjects/CashAp
