[Killed] PublicVisibility
Component/User/Persistence/UserRepository.php:23:5
         return $this->userMapper->entityToDto($match[0]);
     }
 
-    public function byEmail(string $email): UserDTO
+    protected function byEmail(string $email) : UserDTO
     {
         $match = $this->userRepository->findBy(['email' => $email]);
killedBy: App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
TypeError: Symfony\Bundle\FrameworkBundle\KernelBrowser::loginUser(): Argument #1 ($user) must be of type object, null given, called in /home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Communication/TransactionControllerTest.php on line 17

/home/simondewendt/PhpstormProjects/CashAp

[Killed] IncrementInteger
Component/User/Persistence/UserRepository.php:26:9
     public function byEmail(string $email): UserDTO
     {
         $match = $this->userRepository->findBy(['email' => $email]);
-        return $this->userMapper->entityToDto($match[0]);
+        return $this->userMapper->entityToDto($match[1]);
     }
 }
killedBy: App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
TypeError: Symfony\Bundle\FrameworkBundle\KernelBrowser::loginUser(): Argument #1 ($user) must be of type object, null given, called in /home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Communication/TransactionControllerTest.php on line 17

/home/simondewendt/PhpstormProjects/CashAp
