[Killed] PublicVisibility
DTO/UserDTO.php:19:5
         return $this->password;
     }
 
-    public function setPassword(string $password): void
+    protected function setPassword(string $password) : void
     {
         $this->password = $password;
killedBy: App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testGetLoginStatus
statusReason: 1) App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testGetLoginStatus
Error: Call to protected method App\DTO\UserDTO::setPassword() from scope App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/AccountBusinessFacadeTest.php:62

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
DTO/UserDTO.php:29:5
         return $this->email;
     }
 
-    public function setEmail(string $email): void
+    protected function setEmail(string $email) : void
     {
         $this->email = $email;
killedBy: App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testGetLoginStatus
statusReason: 1) App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testGetLoginStatus
Error: Call to protected method App\DTO\UserDTO::setEmail() from scope App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/AccountBusinessFacadeTest.php:61

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
DTO/UserDTO.php:39:5
         return $this->username;
     }
 
-    public function setUsername(string $username): void
+    protected function setUsername(string $username) : void
     {
         $this->username = $username;
killedBy: App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testGetLoginStatus
statusReason: 1) App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest::testGetLoginStatus
Error: Call to protected method App\DTO\UserDTO::setUsername() from scope App\Tests\src\Component\Account\Business\AccountBusinessFacadeTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Business/AccountBusinessFacadeTest.php:60

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
