[Killed] PublicVisibility
Entity/DepositValue.php:24:5
         return $this->id;
     }
 
-    public function getValue(): ?string
+    protected function getValue() : ?string
     {
         return $this->value;
killedBy: App\Tests\src\Component\Account\Communication\DepositControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\DepositControllerTest::testAction
TypeError: Symfony\Bundle\FrameworkBundle\KernelBrowser::loginUser(): Argument #1 ($user) must be of type object, null given, called in /home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Communication/DepositControllerTest.php on line 17

/home/simondewendt/PhpstormProjects/CashAppSymfony
