[Killed] PublicVisibility
Entity/Transaction.php:29:5
     #[ORM\Column(length: 100)]
     private ?string $purpose = null;
 
-    public function getId(): ?int
+    protected function getId() : ?int
     {
         return $this->id;
killedBy: App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testEntityToDto
statusReason: 1) App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testEntityToDto
Error: Call to protected method App\Entity\Transaction::getId() from scope App\Component\Account\Persistence\Mapper\TransactionMapper

/home/simondewendt/PhpstormProjects/CashAppSymfony/src/Component/Account/Persistence/Mapper/TransactionMapper.php:13
/home/simondewendt/PhpstormProjects/CashAppSymfony/test

[Killed] PublicVisibility
Entity/Transaction.php:34:5
         return $this->id;
     }
 
-    public function setId(?int $id): void
+    protected function setId(?int $id) : void
     {
         $this->id = $id;
killedBy: App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testEntityToDto
statusReason: 1) App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testEntityToDto
Error: Call to protected method App\Entity\Transaction::setId() from scope App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Persistence/Mapper/TransactionMapperTest.php:28

ERRORS!
Tests: 1, Assertions:

[Killed] PublicVisibility
Entity/Transaction.php:39:5
         $this->id = $id;
     }
 
-    public function getUserID(): ?int
+    protected function getUserID() : ?int
     {
         return $this->userID;
killedBy: App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testEntityToDto
statusReason: 1) App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testEntityToDto
Error: Call to protected method App\Entity\Transaction::getUserID() from scope App\Component\Account\Persistence\Mapper\TransactionMapper

/home/simondewendt/PhpstormProjects/CashAppSymfony/src/Component/Account/Persistence/Mapper/TransactionMapper.php:15
/home/simondewendt/PhpstormProjects/CashAppSymfony/

[Killed] PublicVisibility
Entity/Transaction.php:44:5
         return $this->userID;
     }
 
-    public function setUserID(int $userID): static
+    protected function setUserID(int $userID) : static
     {
         $this->userID = $userID;
killedBy: App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testEntityToDto
statusReason: 1) App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testEntityToDto
Error: Call to protected method App\Entity\Transaction::setUserID() from scope App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Persistence/Mapper/TransactionMapperTest.php:25

ERRORS!
Tests: 1, Assertio

[Killed] PublicVisibility
Entity/Transaction.php:51:5
         return $this;
     }
 
-    public function getValue(): ?float
+    protected function getValue() : ?float
     {
         return $this->value;
killedBy: App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testEntityToDto
statusReason: 1) App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testEntityToDto
Error: Call to protected method App\Entity\Transaction::getValue() from scope App\Component\Account\Persistence\Mapper\TransactionMapper

/home/simondewendt/PhpstormProjects/CashAppSymfony/src/Component/Account/Persistence/Mapper/TransactionMapper.php:14
/home/simondewendt/PhpstormProjects/CashAppSymfony/t

[Killed] PublicVisibility
Entity/Transaction.php:56:5
         return $this->value;
     }
 
-    public function setValue(float $value): static
+    protected function setValue(float $value) : static
     {
         $this->value = $value;
killedBy: App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testEntityToDto
statusReason: 1) App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testEntityToDto
Error: Call to protected method App\Entity\Transaction::setValue() from scope App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Persistence/Mapper/TransactionMapperTest.php:24

ERRORS!
Tests: 1, Assertion

[Killed] PublicVisibility
Entity/Transaction.php:63:5
         return $this;
     }
 
-    public function getCreatedAt(): ?\DateTimeInterface
+    protected function getCreatedAt() : ?\DateTimeInterface
     {
         return $this->createdAt;
killedBy: App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testEntityToDto
statusReason: 1) App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testEntityToDto
Error: Call to protected method App\Entity\Transaction::getCreatedAt() from scope App\Component\Account\Persistence\Mapper\TransactionMapper

/home/simondewendt/PhpstormProjects/CashAppSymfony/src/Component/Account/Persistence/Mapper/TransactionMapper.php:16
/home/simondewendt/PhpstormProjects/CashAppSymfo

[Killed] PublicVisibility
Entity/Transaction.php:68:5
         return $this->createdAt;
     }
 
-    public function setCreatedAt(\DateTimeInterface $createdAt): static
+    protected function setCreatedAt(\DateTimeInterface $createdAt) : static
     {
         $this->createdAt = $createdAt;
killedBy: App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testEntityToDto
statusReason: 1) App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testEntityToDto
Error: Call to protected method App\Entity\Transaction::setCreatedAt() from scope App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Persistence/Mapper/TransactionMapperTest.php:26

ERRORS!
Tests: 1, Asser

[Killed] PublicVisibility
Entity/Transaction.php:75:5
         return $this;
     }
 
-    public function getPurpose(): ?string
+    protected function getPurpose() : ?string
     {
         return $this->purpose;
killedBy: App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testEntityToDto
statusReason: 1) App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testEntityToDto
Error: Call to protected method App\Entity\Transaction::getPurpose() from scope App\Component\Account\Persistence\Mapper\TransactionMapper

/home/simondewendt/PhpstormProjects/CashAppSymfony/src/Component/Account/Persistence/Mapper/TransactionMapper.php:17
/home/simondewendt/PhpstormProjects/CashAppSymfony

[Killed] PublicVisibility
Entity/Transaction.php:80:5
         return $this->purpose;
     }
 
-    public function setPurpose(string $purpose): static
+    protected function setPurpose(string $purpose) : static
     {
         $this->purpose = $purpose;
killedBy: App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testEntityToDto
statusReason: 1) App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest::testEntityToDto
Error: Call to protected method App\Entity\Transaction::setPurpose() from scope App\Tests\src\Component\Account\Persistence\Mapper\TransactionMapperTest

/home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Persistence/Mapper/TransactionMapperTest.php:27

ERRORS!
Tests: 1, Asserti
