[Killed] PublicVisibility
Entity/User.php:42:5
         return $this->id;
     }
 
-    public function getUsername(): ?string
+    protected function getUsername() : ?string
     {
         return $this->username;
killedBy: App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
TypeError: Symfony\Bundle\FrameworkBundle\KernelBrowser::loginUser(): Argument #1 ($user) must be of type object, null given, called in /home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Communication/TransactionControllerTest.php on line 17

/home/simondewendt/PhpstormProjects/CashAp

[Killed] PublicVisibility
Entity/User.php:54:5
         return $this;
     }
 
-    public function getEmail(): ?string
+    protected function getEmail() : ?string
     {
         return $this->email;
killedBy: App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
TypeError: Symfony\Bundle\FrameworkBundle\KernelBrowser::loginUser(): Argument #1 ($user) must be of type object, null given, called in /home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Communication/TransactionControllerTest.php on line 17

/home/simondewendt/PhpstormProjects/CashAp
