[Killed] MethodCallRemoval
Form/DepositFormType.php:15:9
 {
     public function buildForm(FormBuilderInterface $builder, array $options): void
     {
-        $builder
-            ->add('value', null)
-            ->add('Hochladen', SubmitType::class, [
-                'attr' => [
-                    'class' => 'button',
-                ],
-            ]);
+        
     }
 
killedBy: App\Tests\src\Component\Account\Communication\DepositControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\DepositControllerTest::testAction
TypeError: Symfony\Bundle\FrameworkBundle\KernelBrowser::loginUser(): Argument #1 ($user) must be of type object, null given, called in /home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Communication/DepositControllerTest.php on line 17

/home/simondewendt/PhpstormProjects/CashAppSymfony

[Killed] ArrayItemRemoval
Form/DepositFormType.php:18:17
         $builder
             ->add('value', null)
             ->add('Hochladen', SubmitType::class, [
-                'attr' => [
-                    'class' => 'button',
-                ],
+                $builder->add('value', null)->add('Hochladen', SubmitType::class, ['attr' => []]);
             ]);
     }
killedBy: App\Tests\src\Component\Account\Communication\DepositControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\DepositControllerTest::testAction
TypeError: Symfony\Bundle\FrameworkBundle\KernelBrowser::loginUser(): Argument #1 ($user) must be of type object, null given, called in /home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Communication/DepositControllerTest.php on line 17

/home/simondewendt/PhpstormProjects/CashAppSymfony

[Killed] MethodCallRemoval
Form/DepositFormType.php:26:9
 
     public function configureOptions(OptionsResolver $resolver): void
     {
-        $resolver->setDefaults([
-            'data_class' => DepositValue::class,
-        ]);
+        
     }
 }
killedBy: App\Tests\src\Component\Account\Communication\DepositControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\DepositControllerTest::testAction
TypeError: Symfony\Bundle\FrameworkBundle\KernelBrowser::loginUser(): Argument #1 ($user) must be of type object, null given, called in /home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Communication/DepositControllerTest.php on line 17

/home/simondewendt/PhpstormProjects/CashAppSymfony
