[Survived] MethodCallRemoval
Form/UserDTOType.php:61:9
 
     public function configureOptions(OptionsResolver $resolver): void
     {
-        $resolver->setDefaults([
-            'data_class' => UserDTO::class,
-        ]);
+        
     }
 }
