[Killed] MethodCallRemoval
Repository/UserRepository.php:21:9
 {
     public function __construct(ManagerRegistry $registry)
     {
-        parent::__construct($registry, User::class);
+        
     }
 
killedBy: App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
Error: Call to a member function hasField() on null

/home/simondewendt/PhpstormProjects/CashAppSymfony/vendor/doctrine/orm/lib/Doctrine/ORM/EntityRepository.php:360
/home/simondewendt/PhpstormProjects/CashAppSymfony/vendor/doctrine/orm/lib/Doctrine/ORM/EntityRepository.php:276
/home/simondewendt/PhpstormProject
