[Killed] PublicVisibility
Symfony/AbstractController.php:11:5
 
 class AbstractController extends SymfonyAbstractController
 {
-    public function getLoggedInUser(): User
+    protected function getLoggedInUser() : User
     {
         $user = $this->getUser();
killedBy: App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
TypeError: Symfony\Bundle\FrameworkBundle\KernelBrowser::loginUser(): Argument #1 ($user) must be of type object, null given, called in /home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Communication/TransactionControllerTest.php on line 17

/home/simondewendt/PhpstormProjects/CashAp

[Killed] InstanceOf_
Symfony/AbstractController.php:14:9
     public function getLoggedInUser(): User
     {
         $user = $this->getUser();
-        if (!$user instanceof User) {
+        if (!false) {
             throw new \RuntimeException('user not logged in');
         }
killedBy: App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
TypeError: Symfony\Bundle\FrameworkBundle\KernelBrowser::loginUser(): Argument #1 ($user) must be of type object, null given, called in /home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Communication/TransactionControllerTest.php on line 17

/home/simondewendt/PhpstormProjects/CashAp

[Killed] LogicalNot
Symfony/AbstractController.php:14:9
     public function getLoggedInUser(): User
     {
         $user = $this->getUser();
-        if (!$user instanceof User) {
+        if ($user instanceof User) {
             throw new \RuntimeException('user not logged in');
         }
killedBy: App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
statusReason: 1) App\Tests\src\Component\Account\Communication\TransactionControllerTest::testAction
TypeError: Symfony\Bundle\FrameworkBundle\KernelBrowser::loginUser(): Argument #1 ($user) must be of type object, null given, called in /home/simondewendt/PhpstormProjects/CashAppSymfony/tests/src/Component/Account/Communication/TransactionControllerTest.php on line 17

/home/simondewendt/PhpstormProjects/CashAp
