13) /home/simondewendt/PhpstormProjects/CashAppSymfony/src/Component/Account/Business/Validation/DayValidator.php:18    [M] GreaterThan

--- Original
+++ New
@@ @@
     {
         $dayBalance = $this->balance->calculateBalancePerDay($userID);
         $limit = $dayBalance + $amount;
-        if ($limit > 500.0) {
+        if ($limit >= 500.0) {
             throw new AccountValidationException('Tägliches Einzahlungslimit von 500€ überschritten!');
         }
     }
 }

14) /home/simondewendt/PhpstormProjects/CashAppSymfony/src/Component/Account/Business/Validation/DayValidator.php:18    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
     {
         $dayBalance = $this->balance->calculateBalancePerDay($userID);
         $limit = $dayBalance + $amount;
-        if ($limit > 500.0) {
+        if ($limit <= 500.0) {
             throw new AccountValidationException('Tägliches Einzahlungslimit von 500€ überschritten!');
         }
     }
 }

17) /home/simondewendt/PhpstormProjects/CashAppSymfony/src/Component/Account/Business/Validation/HourValidator.php:18    [M] GreaterThan

--- Original
+++ New
@@ @@
     {
         $hourBalance = $this->balance->calculateBalancePerHour($userID);
         $limit = $hourBalance + $amount;
-        if ($limit > 100.0) {
+        if ($limit >= 100.0) {
             throw new AccountValidationException('Stündliches Einzahlungslimit von 100€ überschritten!');
         }
     }
 }

18) /home/simondewendt/PhpstormProjects/CashAppSymfony/src/Component/Account/Business/Validation/HourValidator.php:18    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
     {
         $hourBalance = $this->balance->calculateBalancePerHour($userID);
         $limit = $hourBalance + $amount;
-        if ($limit > 100.0) {
+        if ($limit <= 100.0) {
             throw new AccountValidationException('Stündliches Einzahlungslimit von 100€ überschritten!');
         }
     }
 }

20) /home/simondewendt/PhpstormProjects/CashAppSymfony/src/Component/Account/Business/Validation/SingleValidator.php:9    [M] LessThan

--- Original
+++ New
@@ @@
 {
     public function validate(float $amount, int $userID) : void
     {
-        if ($amount < 0.01 || $amount > 50) {
+        if ($amount <= 0.01 || $amount > 50) {
             throw new AccountValidationException('Bitte einen Betrag von mindestens 0.01€ und maximal 50€ eingeben!');
         }
     }
 }

21) /home/simondewendt/PhpstormProjects/CashAppSymfony/src/Component/Account/Business/Validation/SingleValidator.php:9    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
 {
     public function validate(float $amount, int $userID) : void
     {
-        if ($amount < 0.01 || $amount > 50) {
+        if ($amount >= 0.01 || $amount > 50) {
             throw new AccountValidationException('Bitte einen Betrag von mindestens 0.01€ und maximal 50€ eingeben!');
         }
     }
 }

22) /home/simondewendt/PhpstormProjects/CashAppSymfony/src/Component/Account/Business/Validation/SingleValidator.php:9    [M] GreaterThan

--- Original
+++ New
@@ @@
 {
     public function validate(float $amount, int $userID) : void
     {
-        if ($amount < 0.01 || $amount > 50) {
+        if ($amount < 0.01 || $amount >= 50) {
             throw new AccountValidationException('Bitte einen Betrag von mindestens 0.01€ und maximal 50€ eingeben!');
         }
     }
 }

23) /home/simondewendt/PhpstormProjects/CashAppSymfony/src/Component/Account/Business/Validation/SingleValidator.php:9    [M] LogicalOrAllSubExprNegation

--- Original
+++ New
@@ @@
 {
     public function validate(float $amount, int $userID) : void
     {
-        if ($amount < 0.01 || $amount > 50) {
+        if (!($amount < 0.01) || !($amount > 50)) {
             throw new AccountValidationException('Bitte einen Betrag von mindestens 0.01€ und maximal 50€ eingeben!');
         }
     }
 }
