70) /home/simondewendt/PhpstormProjects/CashAppSymfony/src/Form/TransactionDTOType.php:36    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function configureOptions(OptionsResolver $resolver) : void
     {
-        $resolver->setDefaults(['data_class' => TransactionDTO::class]);
+        
     }
 }
